## Pandas 
Pandas 是在numpy基础上 建立的新程序库，提供了一种更高效的DataFrame数据结构，其本质是一种带行列标签、支持相同数据类型和缺失值的多维数组

本教程来源于《Python数据科学手册》第三章

In [2]:
# 安装好后可以检查一下版本号
import pandas
pandas.__version__

import numpy as np
import pandas as pd

如果从底层视角观察Pandas对象，可以把他们看成是增强版的NumPy结构化数组，行列都不是简单的整数索引还可以带标签。首先介绍Pandas三个基本的数据结构：__Serise、DataFrame__和__Index__

## 2 Series对象
pandas的Serise对象是一个带索引数据的一维数组
> Numpy隐式定义整数索引获取数值，Pandas的Serise对象显式定义索引与数值关联

In [105]:
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
print(data)

# Serise 是通用的Numpy数组
# Series 是特殊的字典
population_dict = {'California':38332521,'Texas':26448193}
population = pd.Series(population_dict)

# 创建Series 对象
# pd.Series(data,index=index)
# 如果index为空，自动生成一个默认整数序列
print(pd.Series([2,5,9]))
# data也可以是一个标量，填充到每一个索引
print(pd.Series(5,[100,200,300]))
# data还可以是一个字典，字典键排序
print(pd.Series({2:'a',3:'b'}))

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64
0    2
1    5
2    9
dtype: int64
100    5
200    5
300    5
dtype: int64
2    a
3    b
dtype: object

###  DataFrame对象

如果将Series比作带灵活索引的一维数组，DataFrame可以看做一种既有灵活行索引，也有灵活列名的二维数组

In [42]:
population = pd.Series({'California':38332521,'Texas':26448193})
area = pd.Series({'California':423967,'Texas':695662})
states = pd.DataFrame({'population':population,'area':area})
# dataframe有两个行标签和列标签对象
print(states)
# 行标签
print(states.index)
# 列标签
print(states.columns)

# 创建DataFrame的几种方式

# 1 单个Series创建
pd.DataFrame(population,columns=['population'])

# 2 通过字典列表创建
data = [{'a':i,'b':2*i} for i in range(3)]
pd.DataFrame(data)

# 3 通过Series对象字典创建，像之前那样
states = pd.DataFrame({'population':population,'area':area})

# 4 numpy二维数组创建
pd.DataFrame(np.random.rand(3,2),columns=['foo','bar'],index=['a','b','c'])

# 5 numpy 结构化数组创建

              area  population
California  423967    38332521
Texas       695662    26448193
Index(['California', 'Texas'], dtype='object')
Index(['area', 'population'], dtype='object')

        foo       bar
a  0.547937  0.822852
b  0.503197  0.368418
c  0.402269  0.542773

### index对象
pandas 的index 对象是一个很有趣的数据结构，不可变数组或有序集合

In [44]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

print(indA & indB)
print(indA | indB)
print(indA ^ indB)

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
Int64Index([1, 2, 9, 11], dtype='int64')

## 3 Series数据选择方法

In [13]:
import pandas as pd
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])

# 字典方法
print(data['b'])
print('a' in data)
print(list(data.items()))

# 数组方法 需要注意显示索引包含最后一个元素，隐式所以不包括
# 显示索引
print(data['a':'c'])
# 隐式索引
print(data[2])
print(data[(data>0.3)&(data<0.7)])

# 使用索引器（indexer）
print(data.loc['a'])
print(data.iloc[1])

0.5
True
[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]
a    0.25
b    0.50
c    0.75
dtype: float64
0.75
b    0.5
dtype: float64
0.25
0.5

### DataFrame数据选择方法

In [26]:
area = pd.Series({'California':423967,'Texas':695662,'New York':141297,'Florida':170312,'Illinois':149995})
population = pd.Series({'California':38332521,'Texas':26448193,'New York':19651127,'Florida':19552860,'Illinois':12882135})
states = pd.DataFrame({'population':population,'area':area})
states['density'] = states['population'] / states['area']
# 字典方法、数组方法
print(states['area'])
print(states[1:3])
# 使用loc iloc函数
print(states.iloc[:3,:2])

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64
            area  population     density
Florida   170312    19552860  114.806121
Illinois  149995    12882135   85.883763
              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135

## 4 保留索引和索引对齐

In [4]:
# 保留索引
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.randint(0,10,(5,4)),columns=['A','B','C','D'])
print(np.sin(df * np.pi / 4))

# 索引对齐
A = pd.DataFrame(rng.randint(0,10,(2,3)),columns=['A','B','C'])
B = pd.DataFrame(rng.randint(0,10,(5,4)),columns=['A','B','C','D'])
print(A+B)

# 用A的均值去填充缺失值
fill = A.stack().mean()
print(A.add(B,fill_value=fill))

          A             B         C             D
0 -1.000000  7.071068e-01 -0.707107  1.224647e-16
1 -1.000000  7.071068e-01  1.000000 -1.000000e+00
2 -0.707107  1.224647e-16  0.707107 -7.071068e-01
3 -0.707107  1.000000e+00 -0.707107  1.224647e-16
4  0.707107 -7.071068e-01 -0.707107  7.071068e-01
      A     B     C   D
0  13.0   2.0  15.0 NaN
1  13.0  10.0   4.0 NaN
2   NaN   NaN   NaN NaN
3   NaN   NaN   NaN NaN
4   NaN   NaN   NaN NaN
           A          B          C          D
0  13.000000   2.000000  15.000000   7.333333
1  13.000000  10.000000   4.000000   6.333333
2  10.333333   8.333333  12.333333  10.333333
3   5.333333   7.333333  12.333333   5.333333
4  13.333333  12.333333  13.333333   8.333333

## 5 处理缺失值

大多数教程中的数据与现实中的数据却别在于后者很少是干净整齐的，许多目前流行的数据集都出现数据缺失的现象。
本书介绍一些处理缺失值的通用规则，Pandas对缺失值的表现形式主要有三种：null、NaN 和 NA

数据表中DataFrame中有许多识别缺失值的方法。一般情况下分为两种：
>* 通过一个覆盖全局的掩码表示缺失值  掩码可能是布尔类型数组或01比特表示局部状态
>* 用一个标签值表示缺失值 可能是具体的数据（-99999）也可能是全局的值（NAN）

Pandas缺失值延续了Numpy程序包的方式，最终选择标签方法表示缺失值，包括两种Python原有的缺失值：浮点型NAN和Python的None对象

In [17]:
# None Python对象缺失值
vals1 = np.array([1,None,3,4])
# 表示一个对象数组，这时进行数值操作会报错
# vals1.sum()

# Nan 数值类型的缺失值
vals2 = np.array([1,np.nan,3,4])
print(vals2.dtype)

print(1 + np.nan)
print(0 *  np.nan)
print(vals2.sum())

# Panda中 Nan 和 None 的差异
# Pandas 视为可以等价交换
pd.Series([1,np.nan,2,None])

float64
nan
nan
nan

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

### 处理缺失值
常见的处理函数如下：
>* isnull()  创建一个布尔类型掩码标签缺失值
>* notnull() 与isnull() 相反
>* dropna() 返回一个剔除缺失值的数据
>* fillna() 返回一个填充确实值得数据副本

In [39]:
# 1 发现缺失值
data = pd.Series([1,np.nan,'hello',None])
print(data.isnull())

# 2 剔除缺失值
print(data.dropna())
# 对于DataFrame则需要进行一些配置
df = pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])
print(df)

print('****************************')
# 默认情况下会剔除任何包含缺失值的整行数据
print(df.dropna())
print('****************************')
# 当然也可以提出包含列缺失值的数据
print(df.dropna(axis=1))
print('****************************')
# 只剔除全部是空值得行、列
print(df.dropna(how='all'))

print('****************************')
# 3 填充缺失值
data = pd.Series([1,np.nan,2,None,3],index=list('abcde'))
print(data)
# 单独的值填充
print('****************************')
print(data.fillna(0))
# 取有效值向前、向后填充 
print('****************************')
print(data.fillna(method='ffill'))
print('****************************')
print(data.fillna(method='bfill'))

0    False
1     True
2    False
3     True
dtype: bool
0        1
2    hello
dtype: object
     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6
****************************
     0    1  2
1  2.0  3.0  5
****************************
   2
0  2
1  5
2  6
****************************
     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6
****************************
a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64
****************************
a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64
****************************
a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64
****************************
a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## 6 层级索引
目前为止，我们接触的都是一维数据或二维数据，用Pandas的Series和DataFrame就能储存。然而我们遇到多维数据的存储需求，数据索引超过两个键。因此Pandas提供了一种层级索引

In [3]:
# 仍旧使用年份和城市的二维索引
area = pd.Series({'California':423967,'Texas':695662,'New York':141297,'Florida':170312,'Illinois':149995})
population = pd.Series({'California':38332521,'Texas':26448193,'New York':19651127,'Florida':19552860,'Illinois':12882135})
states = pd.DataFrame({'population':population,'area':area})

# 一个二级索引和一个DataFrame等价
states_df = states.stack()

print(states_df)
print(states_df.unstack())

# 笛卡儿积的显示创建
print(pd.MultiIndex.from_product([['a','b'],[1,2]]))

# 多级行列、索引
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

data = np.round(np.random.randn(4,6),1)
data[:,::2] *=10
data +=37

health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

California  area            423967
            population    38332521
Florida     area            170312
            population    19552860
Illinois    area            149995
            population    12882135
New York    area            141297
            population    19651127
Texas       area            695662
            population    26448193
dtype: int64
              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193
MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  36.0  37.0  36.7  26.0  39.4
     2      44.0  35.4  35.0  36.9  32.0  36.0
2014 1      25.0  37.7  17.0  35.5  50.0  36.0
     2      32.0  37.5  38.0  37.4  29.0  38.6

## 7 合并数据集

In [54]:
# 定义一个创建某种Dataframe形式的函数待用
def make_df(cols, ind):
    data = {c:[str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data)

make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [63]:
# concat实现简易合并
ser1 = pd.Series([1,2,3])
ser2 = pd.Series([4,5,6])
print(pd.concat([ser1,ser2]))

# 高维数据合并
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
print(pd.concat([df1,df2]))

# 索引重复问题
# 1 捕捉重复索引
try:
    print(pd.concat([df1,df2],verify_integrity=True))
except ValueError as e:
    print("ValueError",e)

# 2忽略索引
print(pd.concat([df1,df2],ignore_index=True))
    
# 3 增加多级索引
print(pd.concat([df1,df2],keys=['df1','df2']))
    
# 4 类似join的合并
df1 = make_df('ABC',[1,2])
df2 = make_df('BCD',[3,4])
print(pd.concat([df1,df2]))

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64
    A   B
0  A1  B1
1  A2  B2
0  A3  B3
1  A4  B4
ValueError Indexes have overlapping values: [0, 1]
    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
        A   B
df1 0  A1  B1
    1  A2  B2
df2 0  A3  B3
    1  A4  B4
     A   B   C    D
0   A1  B1  C1  NaN
1   A2  B2  C2  NaN
0  NaN  B3  C3   D3
1  NaN  B4  C4   D4

## 8 合并数据集： 合并与连接

In [77]:
# 一对一连接
# 一对一连接是最简单的数据合并类型，与按列合并十分相似
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                    'group':['Accouting','Engineering','Engineering','HR']})
df2 = pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],
                   'Hire_date':[2004,2008,2012,2014]})
print(df1)
print(df2)
df3 = pd.merge(df1,df2)
print(df3)
print('***********************************************')

# 多对一连接
print(df3)
df4 = pd.DataFrame({'group':['Accouting','Engineering','HR'],
                    'supervisor':['Carly','Guido','Steve']})
print(df4)
print(pd.merge(df3,df4))
print('***********************************************')

# 多对多连接
df5 = pd.DataFrame({'group':['Accouting','Accouting','Engineering','Engineering','HR','HR'],
                    'skills':['math','spreadsheets','coding','linux','spreadsheets','organization']})
print(df1)
print(df5)
print(pd.merge(df1,df5))

  employee        group
0      Bob    Accouting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   Hire_date employee
0       2004     Lisa
1       2008      Bob
2       2012     Jake
3       2014      Sue
  employee        group  Hire_date
0      Bob    Accouting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
***********************************************
  employee        group  Hire_date
0      Bob    Accouting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0    Accouting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  Hire_date supervisor
0      Bob    Accouting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve
***********************************************
  employee        group
0      Bob    Accouting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0    Accouting          math
1    Accouting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob    Accouting          math
1      Bob    Accouting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [82]:
# 设置数据合并的键
# left_on 与 right_on 
print(df1)
print(df2)
print(pd.merge(df1,df2,on='employee'))

# 设置数据连接的集合操作规则
# 连接方式： inner outer left right
df6 = pd.DataFrame({'name':['Peter','Paul','Mary'],
                   'food':['fish','beans','bread']},columns=['name','food'])
df7 = pd.DataFrame({'name':['Mary','Joseph'],
                   'drink':['wine','bear']},columns=['name','drink'])
print('************************************')
print(df6)
print(df7)
print('*************默认内连接*************')
print(pd.merge(df6,df7))
print('*************外连接*************')
print(pd.merge(df6,df7,how='outer'))
print('*************左连接*************')
print(pd.merge(df6,df7,how='left'))
print('*************右连接*************')
print(pd.merge(df6,df7,how='right'))

  employee        group
0      Bob    Accouting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   Hire_date employee
0       2004     Lisa
1       2008      Bob
2       2012     Jake
3       2014      Sue
  employee        group  Hire_date
0      Bob    Accouting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
************************************
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  bear
*************默认内连接*************
   name   food drink
0  Mary  bread  wine
*************外连接*************
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  bear
*************左连接*************
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine
*************右连接*************
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  bear

## 9 累计与分组

In [13]:
import seaborn as sns
planets = sns.load_dataset('planets')
print(planets.shape)
planets.head()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [14]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [15]:
planets.groupby('method').median()

                               number  orbital_period   mass  distance    year
method
Astrometry                        1.0      631.180000    NaN    17.875  2011.5
Eclipse Timing Variations         2.0     4343.500000  5.125   315.360  2010.0
Imaging                           1.0    27500.000000    NaN    40.395  2009.0
Microlensing                      1.0     3300.000000    NaN  3840.000  2010.0
Orbital Brightness Modulation     2.0        0.342887    NaN  1180.000  2011.0
Pulsar Timing                     3.0       66.541900    NaN  1200.000  1994.0
Pulsation Timing Variations       1.0     1170.000000    NaN       NaN  2007.0
Radial Velocity                   1.0      360.200000  1.260    40.445  2009.0
Transit                           1.0        5.714932  1.470   341.000  2012.0
Transit Timing Variations         2.0       57.011000    NaN   855.000  2012.5

In [16]:
planets.groupby('method').describe()

                              distance                                     \
                                 count         mean          std      min
method
Astrometry                         2.0    17.875000     4.094148    14.98
Eclipse Timing Variations          4.0   315.360000   213.203907   130.72
Imaging                           32.0    67.715937    53.736817     7.69
Microlensing                      10.0  4144.000000  2076.611556  1760.00
Orbital Brightness Modulation      2.0  1180.000000     0.000000  1180.00
Pulsar Timing                      1.0  1200.000000          NaN  1200.00
Pulsation Timing Variations        0.0          NaN          NaN      NaN
Radial Velocity                  530.0    51.600208    45.559381     1.35
Transit                          224.0   599.298080   913.876990    38.00
Transit Timing Variations          3.0  1104.333333   915.819487   339.00

                                                                         mass  \
                                     25%       50%        75%      max  count
method
Astrometry                       16.4275    17.875    19.3225    20.77    0.0
Eclipse Timing Variations       130.7200   315.360   500.0000   500.00    2.0
Imaging                          22.1450    40.395   132.6975   165.00    0.0
Microlensing                   2627.5000  3840.000  4747.5000  7720.00    0.0
Orbital Brightness Modulation  1180.0000  1180.000  1180.0000  1180.00    0.0
Pulsar Timing                  1200.0000  1200.000  1200.0000  1200.00    0.0
Pulsation Timing Variations          NaN       NaN        NaN      NaN    0.0
Radial Velocity                  24.4125    40.445    59.2175   354.00  510.0
Transit                         200.0000   341.000   650.0000  8500.00    1.0
Transit Timing Variations       597.0000   855.000  1487.0000  2119.00    0.0

                                          ...   orbital_period                 \
                                   mean   ...              75%            max
method                                    ...
Astrometry                          NaN   ...       823.590000    1016.000000
Eclipse Timing Variations      5.125000   ...      5767.000000   10220.000000
Imaging                             NaN   ...     94250.000000  730000.000000
Microlensing                        NaN   ...      3550.000000    5100.000000
Orbital Brightness Modulation       NaN   ...         0.943908       1.544929
Pulsar Timing                       NaN   ...        98.211400   36525.000000
Pulsation Timing Variations         NaN   ...      1170.000000    1170.000000
Radial Velocity                2.630699   ...       982.000000   17337.500000
Transit                        1.470000   ...        16.145700     331.600590
Transit Timing Variations           NaN   ...       108.505500     160.000000

                                year                                          \
                               count         mean       std     min      25%
method
Astrometry                       2.0  2011.500000  2.121320  2010.0  2010.75
Eclipse Timing Variations        9.0  2010.000000  1.414214  2008.0  2009.00
Imaging                         38.0  2009.131579  2.781901  2004.0  2008.00
Microlensing                    23.0  2009.782609  2.859697  2004.0  2008.00
Orbital Brightness Modulation    3.0  2011.666667  1.154701  2011.0  2011.00
Pulsar Timing                    5.0  1998.400000  8.384510  1992.0  1992.00
Pulsation Timing Variations      1.0  2007.000000       NaN  2007.0  2007.00
Radial Velocity                553.0  2007.518987  4.249052  1989.0  2005.00
Transit                        397.0  2011.236776  2.077867  2002.0  2010.00
Transit Timing Variations        4.0  2012.500000  1.290994  2011.0  2011.75


                                  50%      75%     max
method
Astrometry                     2011.5  2012.25  2013.0
Eclipse Timing Variations      2010.0  2011.00  2012.0
Imaging                        2009.0  2011.00  2013.0
Microlensing                   2010.0  2012.00  2013.0
Orbital Brightness Modulation  2011.0  2012.00  2013.0
Pulsar Timing                  1994.0  2003.00  2011.0
Pulsation Timing Variations    2007.0  2007.00  2007.0
Radial Velocity                2009.0  2011.00  2014.0
Transit                        2012.0  2013.00  2014.0
Transit Timing Variations      2012.5  2013.25  2014.0

[10 rows x 40 columns]

## 10 数据透视表

In [17]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
# 利用分组手工制作一份数据透视表
print(titanic.groupby('sex')[['survived']].mean())

# 这组数据给我们一个直观感受、男性被救几率远远大于男性
# 根据groupby操作，我们或许还可以实现其他想要的效果，利用class与sex分组、选择生还状态列、应用‘mean’累计函数
print(titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack())

        survived
sex
female  0.742038
male    0.188908
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [23]:
# 数据透视表法
print(titanic.pivot_table('survived',index='sex',columns='class'))

# 多级数据透视表
age = pd.cut(titanic['age'],[0,18,90])
# print(age)
titanic.pivot_table('survived',['sex',age],'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [24]:
# 同样，我们可以将船票价格分为两份
fare = pd.qcut(titanic['fare'],2)
titanic.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308